IDEA Open Model
Stirrup Class
Compatible with IDEA StatiCa 20.1
 Stirrup
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.CrossSection.Stirrup
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class Stirrup : OpenObject
Public Class Stirrup
	Inherits OpenObject
The Stirrup type exposes the following members.
Constructors
Name | Description
Stirrup
 Constructor
Top
Properties
Name | Description
AnchorageLenght
 Anchorage Lenght
Diameter
 Diameter
DiameterOfMandrel
 Radius of stirrup mandrel - refering to stirrup axis
Distance
 Longitudinal distance between stirrups
Geometry
 Geometry
IsClosed
 Open / Closed stirrup
Material
 Material
ShearCheck
 Status of shear check, not possible for detailing stirrup
TorsionCheck
 Status of torsion check, not possible for detailing stirrup
Top
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace